Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: `release` - this strategy marks the AMQP message as _released_. The processing continues with the next message. The broker can redeliver the message. Refer to the https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-released[released delivery state documentation].
ja_jp: `release` - この戦略は、AMQP メッセージを _released_ としてマークします。処理は次のメッセージに進みます。ブローカーはメッセージを再配信できます。 https://docs.oasis-open.org/amqp/core/v1.0/os/amqp-core-messaging-v1.0-os.html#type-released[released delivery state documentation] を参照してください。

source: `render` is a method from Lit that will be called to render the page. In this method, you return the markup of the page you want.
ja_jp: `render` は Lit のメソッドで、ページをレンダリングするために呼び出されます。このメソッドでは、必要なページのマークアップを返します。

source: `request-response` to log the request and response contents, or
ja_jp: リクエストと応答の内容をログに記録する `request-response` 、または

source: `requestDNSTimeout` becomes `request-dns-timeout`
ja_jp: `requestDNSTimeout` は `request-dns-timeout` になります

source: `request` a message and expect a reply
ja_jp: `request` メッセージを送信し、返信を期待する

source: `resourceGroup` - Use the default value. Any value is fine though.
ja_jp: `resourceGroup` - デフォルト値を使用してください。どんな値でも構いません。

source: `rest-jackson`, which also brings `rest`. We are going to use it to expose our HTTP endpoints.
ja_jp: `rest-jackson` は `rest` も持ち込みます。HTTPエンドポイントを公開するためにこれを使用します。

source: `resteasy-reactive-jackson`, which also brings `resteasy-reactive`. We are going to use it to expose our HTTP endpoints.
ja_jp: `resteasy-reactive-jackson` 。これは `resteasy-reactive` も持ち込みます。これを使って、HTTPエンドポイントを公開します。

source: `reversed`: Returns a reversed iterator over a list
ja_jp: `reversed`: リストを逆にしたイテレータを返す

source: `rolesAllowed` - List of the security roles permitted to access the resources. It needs a Quarkus Security extension to be present, otherwise it will be ignored. Default is empty.
ja_jp: `rolesAllowed` - リソースへのアクセスが許可されているセキュリティロールのリストです。Quarkus Securityエクステンションが存在する必要があり、存在しない場合は無視されます。デフォルトは空です。

source: `rolesAllowed` - List of the security roles permitted to access the resources. It needs a Quarkus security extension to be present, otherwise it will be ignored. Default is empty.
ja_jp: `rolesAllowed` - リソースへのアクセスが許可されているセキュリティロールのリストです。Quarkusのセキュリティエクステンションが存在する必要があり、存在しない場合は無視されます。デフォルトは空です。

source: `rolesAllowed` - List of the security roles permitted to access this operation. It needs a Quarkus Security extension to be present, otherwise it will be ignored. Default is empty.
ja_jp: `rolesAllowed` - この操作へのアクセスが許可されているセキュリティロールのリストです。Quarkus Securityエクステンションが存在する必要があり、存在しない場合は無視されます。デフォルトは空です。

source: `rolesAllowed` - List of the security roles permitted to access this operation. It needs a Quarkus security extension to be present, otherwise it will be ignored. Default is empty.
ja_jp: `rolesAllowed` - この操作へのアクセスが許可されているセキュリティロールのリスト。Quarkusのセキュリティエクステンションが存在する必要があり、存在しない場合は無視されます。デフォルトは空です。

source: `runtime` or `development`
ja_jp: `runtime` または `development`

source: `sam.jvm.yaml` - (optional) for use with sam cli and local testing
ja_jp: `sam.jvm.yaml` - (オプション) SAM CLI やローカル・テスト用

source: `sam.jvm.yaml` - sam cli deployment script
ja_jp: `sam.jvm.yaml` - SAM CLI デプロイメントスクリプト

source: `sam.native.yaml` - (optional) for use with sam cli and native local testing
ja_jp: `sam.native.yaml` - (オプション) SAM CLI やネイティブ・ローカル・テスト用(オプション)

source: `sam.native.yaml` - sam cli deployment script for native
ja_jp: `sam.native.yaml` - ネイティブ用の SAM CLI デプロイメントスクリプト

source: `scope` - include beans with scope that ends with the given value, i.e. `http://localhost:8080/q/arc/beans?scope=ApplicationScoped`
ja_jp: `scope` - 指定した値で終わるスコープを持つ Bean を含みます (つまり `http://localhost:8080/q/arc/beans?scope=ApplicationScoped`)。

source: `sendText(String message)`: Sends a text message to the client. It returns a `Uni`. It's non-blocking. Make sure you or Quarkus subscribes to the returned `Uni` to send the message. If you return the `Uni` from a method invoked by Quarkus (like with Quarkus REST, Quarkus WebSocket Next or Quarkus Messaging), it will subscribe to it and send the message. For example:
ja_jp: `sendText(String message)`: テキストメッセージをクライアントに送信します。 `Uni` を返します。これはノンブロッキングです。メッセージを送信するには、返された `Uni` をユーザーまたは Quarkus がサブスクライブしていることを確認してください。 Quarkus によって呼び出されたメソッド (Quarkus REST、Quarkus WebSocket Next、Quarkus Messaging など) から `Uni` を返すと、それをサブスクライブしてメッセージを送信します。 以下に例を示します。

source: `sendTextAndAwait(String message)`: Sends a text message to the client and waits for the message to be sent. It's blocking and should only be called from an executor thread.
ja_jp: `sendTextAndAwait(String message)`: テキストメッセージをクライアントに送信し、メッセージが送信されるのを待ちます。これはブロッキングであり、エグゼキュータースレッドからのみ呼び出す必要があります。

source: `send` a message and expect reply
ja_jp: メッセージを `send` (送信)し、返信を待つ。

source: `send` a message and expect reply asynchronously
ja_jp: メッセージを `send` (送信)し、返信を非同期に待つ

source: `send` a message and expect reply in a blocking manner
ja_jp: メッセージを `send` (送信)し、返信を同期に待つ

source: `send` a message to a specific address - one single consumer receives the message.
ja_jp: 特定のアドレスにメッセージを `send` (送信) - 一つのコンシューマーがメッセージを受信する。

source: `serve-http-requests` is a derivative of the document title
ja_jp: `serve-http-requests` はドキュメントのタイトルから派生したものです

source: `set? <singleAttribute>` (and single parameter) which will expand to `update EntityName set <singleAttribute> = ?`
ja_jp: `set? <singleAttribute>` (および単一のパラメータ) は、 `update EntityName set <singleAttribute> = ?` に展開されます。

source: `set? <singleColumnName>` (and single parameter) which will expand to `update EntityName set <singleColumnName> = ?`
ja_jp: `set? <singleColumnName>` （およびシングルパラメータ） は `update from EntityName set <singleColumnName> = ?` に展開されます

source: `set? <singleColumnName>` (and single parameter) which will expand to `update from EntityName set <singleColumnName> = ?`
ja_jp: `set? <singleColumnName>` （およびシングルパラメータ） は `update from EntityName set <singleColumnName> = ?` に展開されます

source: `set? <update-query>` will expand to `update EntityName set <update-query>`
ja_jp: `set? <update-query>` は `update EntityName set <update-query>` に展開されます

source: `set? <update-query>` will expand to `update from EntityName set <update-query>`
ja_jp: `set? <update-query>` は `update from EntityName set <update-query>` に展開されます

source: `set` - to set an initial value if needed
ja_jp: `set`: 必要に応じて初期値を設定します．

source: `share`: use master and replica nodes to execute queries (the specific node for each query is selected randomly)
ja_jp: `share`: マスターノードとレプリカノードを使用してクエリーを実行します (各クエリーの特定のノードは無作為に選択されます)

source: `short` and `java.lang.Short`
ja_jp: `short` および `java.lang.Short`

source: `showImage` is a named parameter.
ja_jp: `showImage` は名前付きパラメーターです。

source: `size` - a page size which should be returned by a list operation. It applies to the paged resources only and is a number starting with 1. Default is 20.
ja_jp: `size` - リスト操作で返されるべきページサイズ。これはページ化されたリソースにのみ適用され、1から始まる数値です。 デフォルトは20です。

source: `size`: Returns the number of key-value mappings in a map
ja_jp: `size` : マップ内のキーと値の対応付けの個数を返します。

source: `smallrye.jwt.new-token.audience`: Specifies the default audience.
ja_jp: `smallrye.jwt.new-token.audience`: デフォルトのオーディエンスを指定します。

source: `smallrye.jwt.new-token.issuer`: Specifies the default issuer.
ja_jp: `smallrye.jwt.new-token.issuer`: デフォルトの発行者を指定します。

source: `smallrye.jwt.sign.key.location` and `smallrye.jwt.encrypt.key.location` properties can be used to point to signing and encryption key locations. The keys can be located on the local file system, classpath, or fetched from the remote endpoints and can be in `PEM` or `JSON Web Key` (`JWK`) formats. For example:
ja_jp: `smallrye.jwt.sign.key.location` プロパティーと `smallrye.jwt.encrypt.key.location` プロパティーを使用して、署名キーと暗号化キーの場所を指定できます。キーは、ローカルファイルシステムやクラスパスに配置するか、リモートエンドポイントから取得でき、 `PEM` または `JSON Web Key` ( `JWK` ) 形式にすることができます。以下はその例です。

source: `sort` - a comma separated list of fields which should be used for sorting a result of a list operation. Fields are sorted in the ascending order unless they're prefixed with a `-`. E.g. `?sort=name,-age` will sort the result by the name ascending by the age descending.
ja_jp: `sort` - リスト操作の結果をソートするために使われるべきフィールドのカンマ区切りのリスト。フィールドの前に `-` を付けない限り、フィールドは昇順でソートされます。例えば `?sort=name,-age` は、名前の昇順、年齢の降順で結果をソートします。

source: `spring-data-rest` uses only a subset of the repository methods for data access. It is important to annotate the correct method in order to customize its REST endpoint:
ja_jp: `spring-data-rest` は、データアクセスにリポジトリメソッドのサブセットのみを使用します。RESTエンドポイントをカスタマイズするためには、正しいメソッドにアノテーションを付けることが重要です。

source: `star-wars-typesafe` is the name of the configured client instance, and corresponds to the `configKey` in the `@GraphQLClientApi` annotation. If you don't want to specify a custom name, you can leave out the `configKey`, and then refer to it by using the fully qualified name of the interface.
ja_jp: `star-wars-typesafe` は設定されたクライアントインスタンスの名前で、 `@GraphQLClientApi` アノテーションの `configKey` に対応しています。カスタム名を指定したくない場合は、 `configKey` を省略して、インターフェイスの完全修飾名を使って参照することができます。

source: `starti` is a `gdb` command that sets a temporary breakpoint at the very first instruction of the program's execution.
ja_jp: `starti` は、プログラム実行の一番最初の命令に一時的なブレークポイントを設定する `gdb` のコマンドです。

source: `status in ?1` will be mapped to `{'status':{$in: ?1}}`
ja_jp: `status in ?1` は `{'status':{$in: ?1}}` にマッピングされます。

source: `status in ?1` will be mapped to `{'status':{$in: [?1]}}`
ja_jp: `status in ?1` は `{'status':{$in: [?1]}}` にマッピングされます。

source: `status` -- the overall result of all the health check procedures
ja_jp: `status` -- すべてのヘルスチェックの結果

source: `stddev`: The standard deviation.
ja_jp: `stddev` : 標準偏差。

source: `stork-service-discovery-consul` provides an implementation of service discovery for Consul. `smallrye-mutiny-vertx-consul-client` is a Consul client which we will use to register our services in Consul.
ja_jp: `stork-service-discovery-consul` はConsulのサービスディスカバリーの実装を提供しています。 `smallrye-mutiny-vertx-consul-client` はConsulのクライアントで、Consulにサービスを登録するために使用します。

source: `stork-service-discovery-kubernetes` provides an implementation of service discovery for Kubernetes. `stork-load-balancer-random` provides an implementation of random load balancer. `quarkus-kubernetes` enables the generation of Kubernetes manifests each time we perform a build. The `quarkuks-kubernetes-client` extension enables the use of the Fabric8 Kubernetes Client in native mode. And `quarkus-container-image-jib` enables the build of a container image using https://github.com/GoogleContainerTools/jib[Jib].
ja_jp: `stork-service-discovery-kubernetes` は Kubernetes 用のサービス検出の実装を提供します。 `stork-load-balancer-random` は、ランダムロードバランサーの実装を提供します。 `quarkus-kubernetes` は、ビルドを実行するたびに Kubernetes マニフェストを生成できるようにします。 `quarkuks-kubernetes-client` エクステンションは、ネイティブモードでの Fabric8 Kubernetes Client の使用を可能にします。 `quarkus-container-image-jib` は https://github.com/GoogleContainerTools/jib[Jib] を使用したコンテナーイメージのビルドを可能にします。

source: `stork-service-discovery-kubernetes` provides an implementation of service discovery for Kubernetes. `stork-load-balancer-random` provides an implementation of random load balancer. `quarkus-kubernetes` enables the generation of Kubernetes manifests each time we perform a build. The `quarkus-kubernetes-client` extension enables the use of the Fabric8 Kubernetes Client in native mode. And `quarkus-container-image-jib` enables the build of a container image using https://github.com/GoogleContainerTools/jib[Jib].
ja_jp: `stork-service-discovery-kubernetes` は、Kubernetes のサービスディスカバリーの実装を提供します。 `stork-load-balancer-random` は、ランダム ロード バランサーの実装を提供します。 `quarkus-kubernetes` は、ビルドを実行するたびに Kubernetes マニフェストの生成を有効にします。 `quarkus-kubernetes-client` エクステンションは、ネイティブ モードで Fabric8 Kubernetes クライアントの使用を有効にします。そして `quarkus-container-image-jib` は、 https://github.com/GoogleContainerTools/jib[Jib] を使用してコンテナ イメージのビルドを有効にします。

source: `stork.my-service.service-discovery` indicates which type of service discovery we will be using to locate the `my-service` service. In our case, it's `kubernetes`. If your access to the Kubernetes cluster is configured via Kube config file, you don't need to configure the access to it. Otherwise, set the proper Kubernetes url using the `quarkus.stork.my-service.service-discovery.k8s-host` property. `quarkus.stork.my-service.service-discovery.application` contains the name of the Kubernetes service Stork is going to ask for. In our case, this is the `color-service` corresponding to the kubernetes service backed by the Red and Blue instances. Finally, `quarkus.stork.my-service.load-balancer.type` configures the service selection. In our case, we use a `random` Load Balancer.
ja_jp: `stork.my-service.service-discovery` は、 `my-service` サービスを見つけるために使用するサービス検出のタイプを示します。ここでは kubernetes です。Kubernetes クラスターへのアクセスが Kube 設定ファイルを介して設定されている場合、それへのアクセスを設定する必要はありません。それ以外の場合は、 `quarkus.stork.my-service.service-discovery.k8s-host` プロパティーを使用して適切な Kubernetes URL を設定します。 `quarkus.stork.my-service.service-discovery.application` には、Stork が要求する Kubernetes サービスの名前が含まれています。ここでは、Red および Blue インスタンスによってサポートされる kubernetes サービスに対応する `color-service` です。最後に、 `quarkus.stork.my-service.load-balancer.type` でサービスの選択を設定します。ここでは、 `random` ロードバランサーを使用します。

source: `str:['<value>']`: Returns the string value, e.g. to easily concatenate another string value
ja_jp: `str:['<value>']`: 文字列値を返します。たとえば、別の文字列値を簡単に連結できます。

source: `str:builder`: Returns a new string builder.
ja_jp: `str:builder`: 新しい文字列ビルダーを返します。

source: `str:concat`: Concatenates the string representations of the specified arguments.
ja_jp: `str:concat`: 指定された引数の文字列表現を連結します。

source: `str:eval`: Evaluates the string representation of the first argument as a template in the <<current_context_object,current context>>.
ja_jp: `str:eval`:<<current_context_object,current context>> で最初の引数の文字列表現をテンプレートとして評価します。

source: `str:fmt` or `str:format`: Formats the supplied string value via `java.lang.String.format()`
ja_jp: `str:fmt` または `str:format`: 与えられた文字列値を `java.lang.String.format()` でフォーマットします。

source: `str:fmt` or `str:format`: format the supplied string value via `java.lang.String.format()`
ja_jp: `str:fmt` または `str:format`: 与えられた文字列値を `java.lang.String.format()` でフォーマットします。

source: `str:join`: Joins the string representations of the specified arguments together with a delimiter.
ja_jp: `str:join`: 指定された引数の文字列表現を区切り文字で結合します。

source: `strava` provider configuration is the only supported configuration which enforces the `quarkus.oidc.authentication.redirect-path` property with the `/strava` path which you can override with another path such as `/fitness`.
ja_jp: `strava` プロバイダー設定は、唯一のサポートされている設定で、 `/strava` パスを使用するように `quarkus.oidc.authentication.redirect-path` プロパティーを 強制します。このパスは、 `/fitness` などの別のパスで上書きできます。

source: `strings` can be used to look for text messages inside the binary:
ja_jp: `strings` は、バイナリ内のテキストメッセージを探すのに使用できます。

source: `sub` claim
ja_jp: `sub` クレーム

source: `system.properties` to configure the Java version
ja_jp: Javaのバージョンを設定する為に `system.properties`

source: `table-prefix` (string): Specify the prefix for a related table name. The default value is `quarkus_`.
ja_jp: `table-prefix` (string）：関連テーブル名のプレフィックスを指定します。 デフォルト値は `quarkus_` です。

source: `takeLast`: Returns the last `n` elements from the given list; throws an `IndexOutOfBoundsException` if `n` is out of range
ja_jp: `takeLast`: 与えられたリストから最後の `n` 要素を返します。 `n` が範囲外の場合は `IndexOutOfBoundsException` を投げます。

source: `take`: Returns the first `n` elements from the given list; throws an `IndexOutOfBoundsException` if `n` is out of range
ja_jp: `take`: 与えられたリストから最初の `n` 要素を返します。 `n` が範囲外の場合は `IndexOutOfBoundsException` を投げます。

source: `test.prop` does not have a `value`
ja_jp: `test.prop` 値は `value`

source: `text/*` which is a sub-type wildcard for any text media type
ja_jp: 任意のテキストメディアタイプのサブタイプワイルドカードである `text/*`

source: `text/html` for HTML (such as with xref:qute.adoc[Qute templating])
ja_jp: HTML の `text/html` (xref:qute.adoc[Qute テンプレート] と同様)

source: `text/plain` which is the default for any endpoint returning a `String`.
ja_jp: `String` を返すエンドポイントのデフォルトである `text/plain`。

source: `this` is the result of `item.callExpensiveLogicToGetTheValue(1,'foo',bazinga)`. The method is only invoked once even though the result may be used in multiple expressions.
ja_jp: `this` は `item.callExpensiveLogicToGetTheValue(1,'foo',bazinga)` の結果です。結果が複数の式で使用されても、このメソッドは一度しか呼び出されません。

source: `throttled` keeps track of received messages and commits an offset of the latest acked message in sequence (meaning, all previous messages were also acked). This strategy guarantees at-least-once delivery even if the channel performs asynchronous processing. The connector tracks the received records and periodically (period specified by `auto.commit.interval.ms`, default: 5000 ms) commits the highest consecutive offset. The connector will be marked as unhealthy if a message associated with a record is not acknowledged in `throttled.unprocessed-record-max-age.ms` (default: 60000 ms). Indeed, this strategy cannot commit the offset as soon as a single record processing fails (see <<error-handling>> to configure what happens on failing processing). If `throttled.unprocessed-record-max-age.ms` is set to less than or equal to `0`, it does not perform any health check verification. Such a setting might lead to running out of memory if there are "poison pill" messages (that are never acked). This strategy is the default if `enable.auto.commit` is not explicitly set to true.
ja_jp: `throttled` は受信したメッセージを追跡し、最新の確認応答済みメッセージのオフセットを順番にコミットします (つまり、以前のすべてのメッセージも確認応答済みです)。このストラテジーは、チャネルが非同期処理を実行する場合でも、少なくとも 1 回の配信を保証します。コネクターは受信したレコードを追跡し、定期的に (`auto.commit.interval.ms` で指定された期間、デフォルト: 5000 ms) 最大の連続オフセットをコミットします。レコードに関連付けられたメッセージが `throttled.unprocessed-record-max-age.ms` (デフォルト: 60000 ms) で確認応答されない場合、コネクターは異常としてマークされます。実際、このストラテジーでは、1 つのレコード処理が失敗してすぐにオフセットをコミットすることはできません (処理失敗時の動作を設定するには、<<error-handling>> を参照)。 `throttled.unprocessed-record-max-age.ms` が `0` 以下に設定されている場合、ヘルスチェックの検証は実行されません。このような設定では、(決して確認応答されない) "poison pill" メッセージがある場合、メモリーが不足する可能性があります。 `enable.auto.commit` が明示的に true に設定されていない場合、このストラテジーがデフォルトになります。

source: `throttled` keeps track of received messages and commits an offset of the latest acked message in sequence (meaning, all previous messages were also acked). This strategy guarantees at-least-once delivery even if the channel performs asynchronous processing. The connector tracks the received records and periodically (period specified by `auto.commit.interval.ms`, default: 5000 ms) commits the highest consecutive offset. The connector will be marked as unhealthy if a message associated with a record is not acknowledged in `throttled.unprocessed-record-max-age.ms` (default: 60000 ms). Indeed, this strategy cannot commit the offset as soon as a single record processing fails. If `throttled.unprocessed-record-max-age.ms` is set to less than or equal to `0`, it does not perform any health check verification. Such a setting might lead to running out of memory if there are "poison pill" messages (that are never acked). This strategy is the default if `enable.auto.commit` is not explicitly set to true.
ja_jp: `throttled` は受信したメッセージを追跡し、最新の ack 済みメッセージのオフセットを順番にコミットします (つまり、以前のすべてのメッセージも ack 済みです)。このストラテジーは、チャネルが非同期処理を実行する場合でも、少なくとも 1 回の配信を保証します。コネクターは受信したレコードを追跡し、定期的に (`auto.commit.interval.ms` で指定された期間、デフォルト: 5000 ms) 最大の連続オフセットをコミットします。レコードに関連付けられたメッセージが `throttled.unprocessed-record-max-age.ms` (デフォルト: 60000 ms) で確認応答されない場合、コネクターは異常としてマークされます。実際、このストラテジーでは、1 つのレコード処理が失敗してすぐにオフセットをコミットすることはできません (処理失敗時の動作を設定するには、<<error-handling>> を参照)。 `throttled.unprocessed-record-max-age.ms` が `0` 以下に設定されている場合、ヘルスチェックの検証は実行されません。このような設定では、(決して ack されない) "poison pill" メッセージがある場合、メモリーが不足する可能性があります。 `enable.auto.commit` が明示的に true に設定されていない場合、このストラテジーがデフォルトになります。

source: `time:format(dateTime,pattern)`: Formats temporal objects from the `java.time` package, `java.util.Date`, `java.util.Calendar` and `java.lang.Number`
ja_jp: `time:format(dateTime,pattern)` : `java.time` パッケージ、 `java.util.Date` 、 `java.util.Calendar` 、 `java.lang.Number` の一時オブジェクトをフォーマットします。

source: `time:format(dateTime,pattern,locale)`: Formats temporal objects from the `java.time` package, `java.util.Date`, `java.util.Calendar` and `java.lang.Number`
ja_jp: `time:format(dateTime,pattern,locale)` : `java.time` パッケージ、 `java.util.Date` 、 `java.util.Calendar` 、 `java.lang.Number` の一時オブジェクトをフォーマットします。

source: `time:format(dateTime,pattern,locale,timeZone)`: Formats temporal objects from the `java.time` package, `java.util.Date`, `java.util.Calendar` and `java.lang.Number`
ja_jp: `time:format(dateTime,pattern,locale,timeZone)` : `java.time` パッケージ、 `java.util.Date` 、 `java.util.Calendar` 、 `java.lang.Number` の一時オブジェクトをフォーマットします。

source: `title` that resolves to `Expressions & Escapes` will be rendered as `Expressions &amp;amp; Escapes`
ja_jp: `title` が `Expressions & Escapes` に解決した場合は、 `Expressions &amp;amp; Escapes` としてレンダリングされます。

source: `tls.crt` for the certificate
ja_jp: 証明書用の `tls.crt`

source: `tls.key` for the private key
ja_jp: 秘密鍵用の `tls.key`

source: `transaction.commit()` and `transaction.rollback()` return `Uni<Void>`
ja_jp: `transaction.commit()` および `transaction.rollback()` は `Uni<Void>` を返します。

source: `true` - The JVM is started in debug mode and will be listening on port `5005`
ja_jp: `true` - JVM はデバッグモードで起動され、 `5005`ポートをリッスンします。

source: `true` is effectively a _default value_ that is only used if the parent scope does not define `enabled` already.
ja_jp: `true` は事実上 _default value_ で、親スコープが `enabled` をすでに定義していない場合にのみ使用されます。

source: `type` (_string_): Configure this property to `jdbc` to enable usage of a Quarkus JDBC datasource for storing transaction logs. The default value is `file-system`.
ja_jp: `type` (_string_)：トランザクションログの保存にQuarkus JDBCデータソースを使用できるようにするには、このプロパティを `jdbc` に設定します。 デフォルト値は `file-system` です。

source: `type` is a dimensional tag with value `prime`.
ja_jp: `type` は、値が `prime` であるディメンションタグです。

source: `types()` or `addType()` must be used to specify the generic type.
ja_jp: 汎用型を指定するには、 `types()` または `addType()` を使用する必要があります。

source: `upx` can compress executables using a different architecture and OS than your host machine. For example, `upx` on a MacOS X machine can compress a Linux 64bits executables.
ja_jp: `upx` は、ホストマシンとは異なるアーキテクチャやOSを使用した実行可能ファイルを圧縮することができます。例えば、MacOS Xマシン上の `upx` は、Linux 64bitsの実行可能ファイルを圧縮することができます。

source: `upx` can compress executables using a different architecture and OS than your host machine. For example, `upx` on a macOS machine can compress a Linux 64-bits executables.
ja_jp: `upx` は、ホストマシンとは異なるアーキテクチャやOSを使用している実行可能ファイルを圧縮することができます。例えば、MacOSマシン上の `upx` は、Linux 64bits の実行可能ファイルを圧縮することができます。

source: `used_packages`, `used_classes` and `used_methods` text file reports come in handy when comparing different versions of the application, e.g. why does the image take longer to build? Or why is the image bigger now?
ja_jp: `used_packages`, `used_classes`, `used_methods` テキストファイルレポートは、アプリケーションの異なるバージョンを比較する際に便利です。例えば、イメージ作成に時間がかかるのはなぜか？また、なぜイメージが大きくなったのか？

source: `username` is a username. Optional in the case of https://www.w3.org/TR/webauthn-3/#discoverable-credential[Discoverable Credentials] (with PassKeys).
ja_jp: `username` はユーザー名です。 https://www.w3.org/TR/webauthn-3/#discoverable-credential[Discoverable Credentials] (PassKeys 付き) の場合はオプションです。

source: `username` is a username. Required.
ja_jp: `username` はユーザー名です。必須です。

source: `username` is anonymous.
ja_jp: `username` は匿名です。
